import { serve } from "@hono/node-server";
import { Hono } from "hono";

const app = new Hono();

const sessions = [
  {
    id: "SESSION_01",
    title:
      "生成AIで世界はこう変わる― エンタープライズが直面する新たな機会とリスク",
    description:
      "生成AIはおそらく人類史上最大の技術革命です。2025年現在、博士号取得者並の専門知識を備え、物理法則を踏まえた動画像生成が可能になっています。また、従来はコンテンツ生成が中心だった生成AIは、今や数時間を要する調査やソフトウェア開発、科学研究の自動化までも担うAIエージェントへと進化しています。エンタープライズにおいては、大幅なコスト削減とスピード向上を実現できる可能性が広がる一方、真のイノベーションを起こすためには業務プロセスそのものの再設計が求められています。本講演では、生成AIの技術的進展を俯瞰しつつ、エンタープライズが直面する「リスクとチャンス」を整理し、必要とされる戦略的対応について展望します。",
  },
  {
    id: "SESSION_02",
    title:
      "No API, No AI, No FUTURE 〜AI時代を動かす原動力と共創。それがAPIファースト〜",
    description:
      "AIを活かすにはAPIが不可欠です。APIなくしてAIの力は十分に発揮されず、真の成長も実現できません。Kongはその想いを力強く世界で広げ、次なる時代への挑戦を続けています。本セッションでは、APIがAI時代の価値創出のエンジンとなる理由とKongのビジョン、そしてAPIファーストが切り拓く共創と未来の可能性を共有します。",
  },
  {
    id: "SESSION_03",
    title: "生命保険業務を支えるDX推進基盤とアーキテクチャ導入",
    description:
      "FWD生命ではDX推進の一環として、マイクロサービスアーキテクチャを導入し、2022年にはKong API Gatewayを採用しました。このアーキテクチャは、当社内のシステムのみならず、FWDグループ共通のソリューションにも活用されており、社内業務の効率化と顧客サービスの拡充に貢献しています。本講演では、当社のDX推進基盤の概要と、それを活用した具体的な取り組みについてご紹介いたします。",
  },
  {
    id: "SESSION_04",
    title:
      "SCSKデジタルオファリング NebulaShift 〜未来を創るエンタープライズアーキテクチャ〜",
    description:
      "SCSKのデジタルオファリング「NebulaShift」は、ビジネスの俊敏性を極限まで高め、次世代の顧客体験を創出します。我々はその心臓部にKONGを据え、AIと連携した高度なAPIマネジメントを駆使することでシステム全体を最適化。これにより、圧倒的なスピードでのサービスローンチと、真にパーソナライズされた体験が現実のものとなります。本セッションでは、KONGと共に我々が描く、エンタープライズアーキテクチャの未来像を皆様と共有いたします。",
  },
  {
    id: "SESSION_05",
    title: "いすゞのAPI基盤づくりの舞台裏 〜APIファーストの実現に向けて〜",
    description:
      "レガシーシステムの刷新やグローバル連携・新サービス創出を見据え、いすゞ自動車はAPIファーストへの取り組みを開始しました。Kongを中核としたAPIマネジメント基盤を構築し、プラットフォームエンジニアリング化によるガバナンス強化と開発者体験向上を目指しています。本セッションでは、導入背景、課題、今後の展望を現場の奮闘や学びとともに紹介し、これから挑戦する方々へのヒントをお届けします。",
  },
  {
    id: "SESSION_06",
    title:
      "API活用が塗り替えるビジネスの新常識 〜相互活用・偶然性がもたらす新たな価値創造〜",
    description:
      "APIはシステム間連携の枠を超え、従来のビジネスモデルや業務プロセスを根本から変革し、新たな競争力を生み出す手段となります。本講演では、TISがKong社の「API First」コンセプトをベースに、国内市場のニーズに即した独自のカスタマイズを加え、先駆けて実践してきた取り組みをご紹介します。TISならではの視点で、API活用の効果を最大化し、競争優位性を獲得するための条件を解説。Kongとの連携によるベストプラクティスもお届けします。",
  },
  {
    id: "SESSION_07",
    title: "SMBC日興証券が語る次世代API戦略",
    description:
      "金融システムには高い可用性と俊敏性の両立が求められます。SMBC日興証券はKongを活用し、オンライン取引『EZトレード』を含むシステム刷新と社内API基盤のモダナイゼーションを推進しています。本講演では、API基盤の重要性、導入背景、期待する成果を解説し、新たなチャレンジを通して金融DXの未来を切り拓く取り組みをご紹介いたします。",
  },
  {
    id: "SESSION_08",
    title:
      "No API, No AI, No FUTURE 〜AI時代を動かす原動力と共創。それがAPIファースト〜（パネルディスカッション）",
    description:
      "イノベーションは、いつも“異なるもの”が出会う瞬間に生まれます。業界、立場、組織、データ…それらの壁を越え、価値をつなぐ接点こそがAPIです。本パネルでは、各業界のプロフェッショナルたちが集結。AI時代にAPIを媒介に交わることで、どんな化学反応が生まれるのか？現場の知恵と経験から、未来のイノベーションのヒントを探ります。",
  },
];

app.get("/sessions", (c) => {
  return c.json(sessions);
});

serve(
  {
    fetch: app.fetch,
    hostname: "0.0.0.0",
    port: 3000,
  },
  (info) => {
    console.log(`Server is running on http://localhost:${info.port}`);
  }
);
